trade_exp/src/InformationRegisters/ГлобальныеЗоныПоЗонамДоставкиДоКлиента/ГлобальныеЗоныПоЗонамДоставкиДоКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="ba84a934-5147-4e17-a640-f03e0ee52475">
  <name>ГлобальныеЗоныПоЗонамДоставкиДоКлиента</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="1e671c52-19b1-44da-b2c0-1c9a3d85b697">
    <name>ГлобальнаяЗона</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="efbabf54-67b8-44a1-b22b-eee14fa0a01a">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="2969abae-f77e-47dc-8bcd-30be27249508">
    <name>Зона</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/ГлобальныеЗоныПоЗонамДоставкиДоКлиента/Forms/ФормаЗагрузки/Module.bsl
&НаКлиенте
Процедура Загрузить(Команда)
	ЗагрузитьНаСервере();
КонецПроцедуры
&НаСервере
Процедура ЗагрузитьНаСервере()
	НомерСтроки = 2;
	ЦветОшибка= Новый Цвет(255,0,0);
	
	Пока Истина Цикл
		Ошибка= Ложь;
		стрНомерСтроки= Формат(НомерСтроки, "ЧРГ=; ЧГ=0");
		
		//Читаем данные
		стрЗонаДоставки= СокрЛП(ТабличныйДокумент.Область("R"+стрНомерСтроки+"C1").Текст);
		Если ПустаяСтрока(стрЗонаДоставки) Тогда 
			Прервать;
		КонецЕсли;
		стрФилиал= СокрЛП(ТабличныйДокумент.Область("R"+стрНомерСтроки+"C2").Текст);
	    стрГлобальнаяЗона = СокрЛП(ТабличныйДокумент.Область("R"+стрНомерСтроки+"C3").Текст);

		//Получаем значения
		ЗонаДоставки= Обработки.КартографическийИнтерфейсДоставка.ПолучитьЗонуДоставкиПоНаименованию(стрЗонаДоставки);
		Если Не ЗначениеЗаполнено(ЗонаДоставки) Тогда
			Ошибка= Истина;
			ТабличныйДокумент.Область("R"+стрНомерСтроки+"C1").ЦветФона= ЦветОшибка;
		КонецЕсли;
				
		Филиал= Справочники.СтруктураПредприятия.НайтиПоНаименованию(стрФилиал, Истина);
		Если Не ЗначениеЗаполнено(Филиал) Тогда
			Ошибка= Истина;
			ТабличныйДокумент.Область("R"+стрНомерСтроки+"C2").ЦветФона= ЦветОшибка;
		КонецЕсли;
						
		ГлобальнаяЗона = Перечисления.ЗоныДоставкиКлиента[стрГлобальнаяЗона];
		Если Не ЗначениеЗаполнено(ГлобальнаяЗона) Тогда
			Ошибка= Истина;
			ТабличныйДокумент.Область("R"+стрНомерСтроки+"C3").ЦветФона= ЦветОшибка;
		КонецЕсли;
		
		//Пишем данные
		Если Не Ошибка Тогда
			НаборЗаписей= РегистрыСведений.ГлобальныеЗоныПоЗонамДоставкиДоКлиента.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Зона.Установить(ЗонаДоставки);
			НаборЗаписей.Отбор.Подразделение.Установить(Филиал);
			
			НаборЗаписей.Прочитать();
			Если НаборЗаписей.Количество() = 0 Тогда
				НоваяЗапись= НаборЗаписей.Добавить();
			Иначе
				НоваяЗапись= НаборЗаписей[0];
			КонецЕсли;
			
			НоваяЗапись.Зона= ЗонаДоставки;
			НоваяЗапись.Подразделение= Филиал;
			НоваяЗапись.ГлобальнаяЗона= ГлобальнаяЗона;			
			
			НаборЗаписей.Записать();
		КонецЕсли;
		
		НомерСтроки= НомерСтроки+1;
	КонецЦикла;
КонецПроцедуры
